[
    {
        "id": "grandma-with-boy",
        "image": "media/grandma_with_boy.png",
        "text": "Once upon a time, there was a blond tall boy named Mateo who lived in New Jersey. Mateo was always fascinated by the stories his grandmother told him about dragons."
    },
    {
        "id": "ceraxes",
        "image": "media/ceraxes.png",
        "text": "One day, as he was playing in the fields near his house, he heard a loud roar. To his surprise, he saw a big red dragon flying overhead."
    },
    {
        "id": "boy-and-dragon",
        "image": "media/boy_and_dragon.png",
        "text": "Mateo was not scared, instead he approached the dragon with a smile on his face and asked him if he could be his friend. The dragon was so taken aback by Mateo's kindness that he agreed to be his friend. The dragon's name was Blaze and he was very lonely as he had no one to play with."
    },
    {
        "id": "boy-and-dragon-moon",
        "image": "media/boy_and_dragon_moon.png",
        "text": "Blaze took Mateo for a ride on his back and they flew around the moon."
    },
    {
        "id": "boy-and-dragon-space",
        "image": "media/boy_and_dragon_space.png",
        "text": "They saw stars twinkling like diamonds and they heard the songs of the stars. Mateo was having the time of his life."
    },
    {
        "id": "dragon-in-cave",
        "image": "media/dragon_in_cave.png",
        "text": "Mateo was not scared, instead he approached the dragon with a smile on his face and asked him if he could. However, their adventure was not over yet. Blaze took Mateo to his secret hideout, where he kept his treasures. Mateo was amazed at what he saw. The hideout was filled with sparkling gems, glittering gold, and shimmering silver. Blaze told Mateo that he could take anything he wanted, as a token of their friendship."
    },
    {
        "id": "ruby",
        "image": "media/ruby.png",
        "text": "Mateo thought for a while and then said, \"Blaze, I don't want any of your treasures. I am happy just being your friend.\" Blaze was so touched by Mateo's words that he gave Mateo a special gift, a shiny red gem that would always remind him of their friendship."
    },
    {
        "id": "dragon-leaves-boy",
        "image": "media/dragon_leaving_boy.png",
        "text": "After their adventure, Blaze took Mateo back home. Mateo went straight to bed, with a smile on his face, dreaming of his amazing journey with Blaze. From that day on, Mateo and Blaze were the best of friends and had many more adventures together."
    },
    {
        "id": "boy-looking-up",
        "image": "media/ending.png",
        "text": "The moral of the story is that kindness can make you rich in ways that money can't buy, and that true friends are the ones who are always there for you, no matter what."
    }

    

]